
title ' "应用多元统计分析"  p277-P279:例7.2.1';
/*----yydy721.sas  */


data d721;
  input number x1-x4 @@ ;
  cards;
1 148 41 72 78   2 139 34 71 76
3 160 49 77 86   4 149 36 67 79
5 159 45 80 86   6 142 31 66 76
7 153 43 76 83   8 150 43 77 79
9 151 42 77 80  10 139 31 68 74
11 140 29 64 74 12 161 47 78 84
13 158 49 78 83 14 140 33 67 77
15 137 31 66 73 16 152 35 73 79
17 149 47 82 79 18 145 35 70 77
19 160 47 74 87 20 156 44 78 85
21 151 42 73 82 22 147 38 73 78
23 157 39 68 80 24 147 30 65 75
25 157 48 80 88 26 151 36 74 80
27 144 36 68 76 28 141 30 67 76
29 139 32 68 73 30 148 38 70 78
;
proc princomp  data=d721 prefix=z out=o721 ;
  var x1-x4;
run;
options ps=32 ls=85;
proc plot data=o721;
   plot z2*z1 $ number='*'/href=-1 href=2 vref=0;
run;
proc sort data=o721;
  by z1;
run;
proc print data=o721;
  var number z1 z2 x1-x4;
run;
quit;