
title ' "应用多元统计分析"  (p68):例3.2.1 ---- 解法二 ';
/*----yydy321b.sas  */

  proc iml;
   n=20; p=3;
   x={3.7 48.5  9.3 ,5.7 65.1  8.0 ,3.8 47.2 10.9 ,
      3.2 53.2 12.0 ,3.1 55.5  9.7 ,4.6 36.1  7.9 ,
      2.4 24.8 14.0 ,7.2 33.1  7.6 ,6.7 47.4  8.5 ,
      5.4 54.1 11.3 ,3.9 36.9 12.7 ,4.5 58.8 12.3 ,
      3.5 27.8  9.8 ,4.5 40.2  8.4 ,1.5 13.5 10.1 ,
      8.5 56.4  7.1 ,4.5 71.6  8.2 ,6.5 52.8 10.9 ,
      4.1 44.1 11.2 ,5.5 40.9  9.4  };
   m0={4 50 10};
   ln={[20] 1} ;
   x0=(ln*x)/n; print x0;
   xm=x0-m0; print xm;
   mm=i(20)-j(20,20,1)/n;
   a=x`*mm*x; print a;
   ai=inv(a); print ai;
   dd=xm*ai*xm`; d2=(n-1)*dd;
   t2=n*d2;
   f=(n-p)*t2/((n-1)*p);
   print dd d2 t2 f;
   p0=1-probf(f,p,n-p);
   print p0;
   fa=finv(0.95,p,n-p);
   beta=probf(fa,p,n-p,t2);
   print fa beta;
quit;
