
title '  "应用多元统计分析"习题三(p103):3-11 ';
/*----yyexa0311.sas  */



  proc iml;
   n1=6;n2=9; p=3;
   x={
      78 60.6 16.5 ,
      76 58.1 12.5 ,
      92 63.2 14.5 ,
      81 59.0 14.0 ,
      81 60.8 15.5 ,
      84 59.5 14.0 };

   lx={[6] 1} ;
   x0=(lx*x)/n1; print x0;
   mmx=i(6)-j(6,6,1)/n1;
   ax=x`*mmx*x; print ax;
   y={
      80 58.4 14.0 ,
      75 59.2 15.0 ,
      78 60.3 15.0 ,
      75 57.4 13.0 ,
      79 59.5 14.0 ,
      78 58.1 14.5 ,
      75 58.0 12.5 ,
      64 55.5 11.0 ,
      80 59.2 12.5 };
   ly={[9] 1} ;
   y0=(ly*y)/n2; print y0;
   xy0=x0-y0; print xy0;
   mmy=i(9)-j(9,9,1)/n2;
   ay=y`*mmy*y; print ay;
   a=ax+ay; ai=inv(a);
   dd=xy0*ai*xy0`; d22=(n1+n2-2)*dd;
   t22=n1*n2*d22/(n1+n2);
   f2=(n1+n2-p-1)*t22/((n1+n2-2)*p);
   print d22 t22 f2;
   p20=1-probf(f2,p,n1+n2-p-1);
   print p20;
run;
quit;