
title '  "应用多元统计分析"习题四(p172):4-4 ';
/*----yyexa0404.sas  */


data d404;
   input num age weight  runtime  rstpulse runpulse maxpulse oxygen;
   cards; 
   1  57  73.37  12.63  58  174   176  39.407
   2  54  79.38  11.17  62  156   165  46.080
   3  52  76.32   9.63  48  164   166  45.441
   4  50  70.87   8.92  48  146   155  54.625
   5  51  67.25  11.08  48  172   172  45.118
   6  54  91.63  12.88  44  168   172  39.203
   7  51  73.71  10.47  59  186   188  45.790
   8  57  59.08   9.93  49  148   155  50.545
   9  49  76.32   9.40  56  186   188  48.673
  10  48  61.24  11.50  52  170   176  47.920
  11  52  82.78  10.50  53  170   172  47.467
  12  44  73.03  10.13  45  168   168  50.541
  13  45  87.66  14.03  56  186   192  37.388
  14  45  66.45  11.12  51  176   176  44.754
  15  47  79.15  10.60  47  162   164  47.273
  16  54  83.12  10.33  50  166   170  51.855
  17  49  81.42   8.95  44  180   185  49.156
  18  51  69.63  10.95  57  168   172  40.836
  19  51  77.91  10.00  48  162   168  46.672
  20  48  91.63  10.25  48  162   164  46.774
  21  49  73.37  10.08  76  168   168  50.388
  22  44  89.47  11.37  62  178   182  44.609
  23  40  75.07  10.07  62  185   185  45.313
  24  44  85.84   8.65  45  156   168  54.297
  25  42  68.15   8.17  40  166   172  59.571
  26  38  89.02   9.22  55  178   180  49.874
  27  47  77.45  11.63  58  176   176  44.811
  28  40  75.98  11.95  70  176   180  45.681
  29  43  81.19  10.85  64  162   170  49.091
  30  44  81.42  13.08  63  174   176  39.442
  31  38  81.87   8.63  48  170   186  60.055
;

proc print ;
  id num;
run;

proc reg data=d404;
   model oxygen=age weight  runtime  rstpulse runpulse maxpulse;
run;
   model oxygen=age weight  runtime  rstpulse runpulse maxpulse/
          selection=stepwise sle=0.15 sls=0.15;
run;  
   model oxygen=age weight  runtime  rstpulse runpulse maxpulse/
          selection=stepwise sle=0.05 sls=0.05;
run;
model oxygen=age weight  runtime  rstpulse runpulse maxpulse/
          selection=adjrsq  b best=10;
run; 
quit; 