
title '  "应用多元统计分析"习题五(p213):5-9 ';
/*----yyexa0509.sas  */



data data509;
   input num type  cu ag bi;
   cards;
1  1  2.58 0.90 0.95
2  1  2.90 1.23 1.00
3  1  3.55 1.15 1.00
4  1  2.35 1.15 0.79
5  1  3.54 1.85 0.79
6  1  2.70 2.23 1.30
7  1  2.70 1.70 0.48
8  0  2.25 1.98 1.06
9  0  2.16 1.80 1.06
10 0  2.33 1.74 1.10
11 0  1.96 1.48 1.04
12 0  1.94 1.40 1.00
13 0  3.00 1.30 1.00
14 0  2.78 1.70 1.48
15 .  2.95 2.15 1.54
;
proc print;
run;


proc discrim data=data509  distance list;
   class type;
   var cu ag bi;
run;
quit;
